#+TITLE:XenHunt Config (programming)
#+AUTHOR: Evgeny Berlizov (XenHunt)
#+DESCRIPTION: XenHunt's config of programming capabilities
#+STARTUP: content
#+PROPERTY: header-args :tangle programming.el
* Multi-Compile
:PROPERTIES:
:CUSTOM_ID: multi-compile
:END:
#+begin_src emacs-lisp
(use-package compile-multi
  :custom
  (compile-multi-default-directory #'projectile-project-root)
  :init
  (defun compile-multi--make-targets ()
    "Parses Makefile content and extracts all make commands."
    (let ((makefile (expand-file-name "Makefile" (projectile-project-root)))
          (commands '()))
      (message makefile)
      (when (file-exists-p makefile)
        (with-temp-buffer
          (insert-file-contents makefile)
          (goto-char (point-min))
          (while (re-search-forward "^\\([^:\n]+\\):" nil t)
            (let ((command (match-string 1)))
              (push (cons (concat "make:" command) (concat "make " command)) commands)))))
      ;; (message 'commands)
      (nreverse commands)))
  ;; :hook
  :config
  (push '((file-exists-p "Makefile")
          compile-multi--make-targets)
        compile-multi-config)
  (push '(emacs-lisp-mode
          ("emacs:bytecompile" . (lambda () (byte-compile-file (buffer-file-name)))))
        compile-multi-config)
  )
#+end_src

#+RESULTS:
: [nil 26367 57809 438122 nil elpaca-process-queues nil nil 276000 nil]

** Consult-Multi-Compile
:PROPERTIES:
:CUSTOM_ID: consult-multi-compile
:END:
#+begin_src emacs-lisp
(use-package consult-compile-multi
  :ensure t
  :after compile-multi
  :demand t
  :config (consult-compile-multi-mode)
  (leader-key
    "p c" '(compile-multi :wk "Project compile")))
#+end_src

#+RESULTS:
: [nil 26367 64528 640962 nil elpaca-process-queues nil nil 204000 nil]

** Compile-Multi-Nerd-Icons
:PROPERTIES:
:CUSTOM_ID: compile-multi-nerd-icons
:END:
#+begin_src emacs-lisp
(use-package compile-multi-nerd-icons
  :ensure t
  :after nerd-icons-completion
  :after compile-multi
  :demand t)
#+end_src

#+RESULTS:
: [nil 26367 63408 636852 nil elpaca-process-queues nil nil 159000 nil]

** Compile-Multi-Embark
:PROPERTIES:
:CUSTOM_ID: compile-multi-embark
:END:
#+begin_src emacs-lisp
(use-package compile-multi-embark
  :ensure t
  :after embark
  :after compile-multi
  :demand t
  :config (compile-multi-embark-mode +1))
#+end_src

#+RESULTS:
: [nil 26367 63411 179384 nil elpaca-process-queues nil nil 700000 nil]

** Git-Gutter
:PROPERTIES:
:CUSTOM_ID: git-gutter
:END:
#+begin_src emacs-lisp
(use-package git-gutter
  :config
  (global-git-gutter-mode +1))
#+end_src

#+RESULTS:
: [nil 26456 21504 104318 nil elpaca-process-queues nil nil 94000 nil]

* Dash-Docs
:PROPERTIES:
:CUSTOM_ID: dash-docs
:END:
#+begin_src emacs-lisp
;; (use-package dash-docs)
;; (use-package consult-dash
;;   :bind (("M-s d" . consult-dash))
;;   :config
;;   ;; Use the symbol at point as initial search term
;;   (consult-customize consult-dash :initial (thing-at-point 'symbol)))
(use-package devdocs
  ;; (leader-key
  ;;   "h d" '(devdocs-lookup :wk "Devdocs Lookup")
  ;;   )
  :custom
  (devdocs-use-mathjax t)
  :config
  (add-hook 'python-mode-hook
            (lambda () (setq-local devdocs-current-docs '("python~3.12" "numpy~2.0"))))
  (add-hook 'emacs-lisp-mode-hook
            (lambda () (setq-local devdocs-current-docs '("elisp"))))
  (add-hook 'typescript-mode-hook
            (lambda () (setq-local devdocs-current-docs '("typescript" "typescript~5.1"))))
  (add-hook 'css-mode-hook
            (lambda () (setq-local devdocs-current-docs '("css"))))
  (add-hook 'clojure-mode-hook
            (lambda () (setq-local devdocs-current-docs '("clojure~1.1"))))
  (add-hook 'html-mode-hook
            (lambda () (setq-local devdocs-current-docs '("html" "bootstrap~5"))))
  (add-hook 'vue-mode-hook
            (lambda () (setq-local devdocs-current-docs '("vue~3" "vuex~4" "vue_router~4"))))
  (add-hook 'bash-mode-hook
            (lambda () (setq-local devdocs-current-docs '("bash"))))
  (add-hook 'latex-mode-hook
            (lambda () (setq-local devdocs-current-docs '("latex"))))  
  (add-hook 'go-mode-hook
            (lambda () (setq-local devdocs-current-docs '("go"))))
  )
#+end_src

#+RESULTS:
: [nil 26356 19987 487003 nil elpaca-process-queues nil nil 265000 nil]
* Dumb-Jump
:PROPERTIES:
:CUSTOM_ID: dumb-jump
:END:
#+begin_src emacs-lisp
(use-package dumb-jump
  :ensure t
  ;; :hook
  ;; (prog-mode . dumb-jump-mode)
  ;; ((xref-backend-functions . dumb-jump-xref-activate))
  :custom
  ;; (xref-show-definitions-functions #'xref-show-definitions-completing-read)
  ;; (xref-show-definitions-functions #'consult-xref)
  (dumb-jump-prefer-searcher 'rg)
  ;; :config
  :config
  (defun i-really-want-to-dumb-jump ()
    "Call `xref-find-definitions' but force the usage of Dumb Jump"
    (interactive)
    (let ((xref-backend-functions '(dumb-jump-xref-activate)))
      (funcall-interactively #'xref-find-definitions)))
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
  )
#+end_src

#+RESULTS:
: [nil 26427 12565 768089 nil elpaca-process-queues nil nil 667000 nil]

** LSP-Mode 
:PROPERTIES:
:CUSTOM_ID: lsp-mode
:END:
#+begin_src emacs-lisp

(add-to-list 'load-path (expand-file-name "lib/lsp-mode" user-emacs-directory))
(add-to-list 'load-path (expand-file-name "lib/lsp-mode/clients" user-emacs-directory))
(setq lsp-pyright-multi-root nil)
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :custom

  ;; (lsp-clients-angular-language-server-command
  ;;  '("node"
  ;;   "/home/berlizoves/.nvm/versions/node/v20.13.1/lib/node_modules/@angular/language-server"
  ;;    "--ngProbeLocations"
  ;;    "/home/berlizoves/.nvm/versions/node/v20.13.1/lib/node_modules/"
  ;;    "--tsProbeLocations"
  ;;    "/home/berlizoves/.nvm/versions/node/v20.13.1/lib/node_modules/"
  ;;    "--stdio"))

  (lsp-clients-angular-language-server-command
   '("ngserver"
     "--stdio"
     "--tsProbeLocations"
     "/home/berlizoves/.nvm/versions/node/v20.17.0/lib/node_modules/"
     "--ngProbeLocations"
     "/home/berlizoves/.nvm/versions/node/v20.17.0/lib/node_modules/@angular/language-server/node_modules/"
     ))
  (lsp-log-io nil) ; ensure this is off when not debugging
  (lsp-completion-provider :none)
  (lsp-completion--enable t)
  (lsp-restart 'auto-restart)
  (lsp-enable-snippet t)
  (lsp-diagnostics-provider :flycheck)
  (lsp-disabled-clients '(eslint))
  (lsp-auto-execute-action nil)
  (lsp-log-max 100)
  ;; (lsp-keymap-prefix "SPC c l")
  (lsp-eldoc-enable-hover nil)
  :init
  ;; (evil-define-minor-mode-key 'normal lsp-mode (kbd "SPC c l") lsp-command-map)
  (defun lsp-booster--advice-json-parse (old-fn &rest args)
    "Try to parse bytecode instead of json."
    (or
     (when (equal (following-char) ?#)
       (let ((bytecode (read (current-buffer))))
         (when (byte-code-function-p bytecode)
           (funcall bytecode))))
     (apply old-fn args)))
  (advice-add (if (progn (require 'json)
                         (fboundp 'json-parse-buffer))
                  'json-parse-buffer
                'json-read)
              :around
              #'lsp-booster--advice-json-parse)

  (defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
    "Prepend emacs-lsp-booster command to lsp CMD."
    (let ((orig-result (funcall old-fn cmd test?)))
      (if (and (not test?)                             ;; for check lsp-server-present?
               (not (file-remote-p default-directory)) ;; see lsp-resolve-final-command, it would add extra shell wrapper
               lsp-use-plists
               (not (functionp 'json-rpc-connection))  ;; native json-rpc
               (executable-find "emacs-lsp-booster"))
          (progn
            (when-let ((command-from-exec-path (executable-find (car orig-result))))  ;; resolve command from exec-path (in case not found in $PATH)
              (setcar orig-result command-from-exec-path))
            (message "Using emacs-lsp-booster for %s!" orig-result)
            (cons "emacs-lsp-booster" orig-result))
        orig-result)))
  (advice-add 'lsp-resolve-final-command :around #'lsp-booster--advice-final-command)

  (defun my/orderless-dispatch-flex-first (_pattern index _total)
    (and (eq index 0) 'orderless-flex))
  (defun fv--lsp-mode-capf-setup ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless)))
  (add-hook 'orderless-style-dispatchers #'my/orderless-dispatch-flex-first nil 'local)
  (setq-local completion-at-point-functions (list (cape-capf-buster #'lsp-completion-at-point)))
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  ;; (setq lsp-keymap-prefix "C-c l")

  (advice-add 'lsp--select-action :filter-args
              (defun get-rid-of/refactor.move (actions_args)
		        (list 
		         (seq-remove (lambda (action)
                               (string= "refactor.move" (plist-get action :kind)))
                             (seq-first actions_args)))))
  :hook (

	     (lsp-completion-mode . fv--lsp-mode-capf-setup)
	     ;; replace XXX-mode with concrete major-mode(e. g. python-mode)
	     ;; (python-mode . lsp)
         ;;     (python-ts-mode . lsp)
	     ((json-mode  yaml-mode javascript-mode js-ts-mode js-mode js-jsx-mode js2-jsx-mode typescript-mode typescript-ts-mode css-mode tsx-ts-mode  vue-mode js2-mode) . lsp-deferred)
	     (lsp-completion-mode . lsp-enable-which-key-integration)
	     (lisp-interaction-mode . lsp)
	     )
  ;; :commands lsp
  :config
  ;; (add-hook 'lsp-mode-hook #'lsp-completion-mode)
  (general-def 'normal lsp-mode :definer 'minor-mode
    "SPC c" lsp-command-map)

  (general-define-key
   :states 'normal
   :keymaps 'lsp-mode-map
   :prefix "SPC"

   "c" '(:ignore t :wk "Code")
   "c s" '(consult-lsp-symbols :wk "Search symbol")
   "c a" '(:ignore t :wk "Actions")
   "c =" '(:ignore t :wk "Format")
   "c F" '(:ignore t :wk "Workspace Folders")
   "c g" '(:ignore t :wk "Find")
   "c G" '(:ignore t :wk "UI Peek")
   "c h" '(:ignore t :wk "Help?")
   "c r" '(:ignore t :wk "Organize/Rename")
   "c T" '(:ignore t :wk "Toggle")
   "c w" '(:ignore t :wk "Maintenance")

   "c d" '(org-babel-detangle :wk "Org-Detangle")
   
   "c c" '(compile :wk "Compile code")
   ;; "c r" '(lsp-rename :wk "Rename object")
   ;; "c d" '(lsp-find-definition :wk "Find definition")
   ;; "c x" '(consult-flycheck :wk "List errors")
   ;; "c R" '(lsp-workspace-restart :wk "Restart LSP")
   "c ." '(i-really-want-to-dumb-jump :wk "Find definition")
   "c x" '(:ignore t :wk "Consult")
   "c x x" '(consult-flycheck :wk "Flycheck")
   "c x s" '(consult-lsp-symbols :wk "Symbols")
   "c x d" '(consult-lsp-diagnostics :wk "Diagnostics"))
  ;; (setq lsp-enabled-clients '(ts-ls pyright angular-ls vue-semantic-server json-ls html-ls eslint css-ls bash-ls))
  )
(elpaca-wait)
(use-package lsp-ui 
  :custom
  (lsp-ui-doc-use-childframe nil)
  (lsp-ui-sideline-show-diagnostics t)
  (lsp-ui-sideline-show-hover t)
  (lsp-ui-doc-enable t)
  (lsp-ui-doc-position 'at-point)
  (lsp-ui-doc-show-with-cursor t )
  :after lsp-mode
  ;; :init
  ;; (add-hook 'lsp-mode-hook 'lsp-ui-mode)
  :hook
  (lsp-mode . lsp-ui-mode)
  (lsp-ui-mode . lsp-ui-doc-mode)
  :config
  
  (general-define-key
   :states 'normal
   :keymaps '(lsp-ui-doc-mode-map)
   ;; :prefix "SPC"
   ;; "c" '(:ignore t :wk "Code")
   "C-'" '(lsp-ui-doc-focus-frame :wk "Focus doc frame")
   )
  (general-define-key
   :states 'normal
   :keymaps '(lsp-ui-doc-frame-mode-map)
   ;; :prefix "SPC"
   ;; "c" '(:ignore t :wk "Code")
   "C-'" '(lsp-ui-doc-unfocus-frame :wk "Unfocus doc frame")))
(use-package consult-lsp
  :defer 3)
#+end_src

#+RESULTS:
: [nil 26445 62659 19937 nil elpaca-process-queues nil nil 426000 nil]

*** Vue
:PROPERTIES:
:CUSTOM_ID: vue
:END:
#+begin_src emacs-lisp
(use-package vue-mode
  ;; :init
  ;; (add-to-list 'auto-mode-alist '("\\.vue\\'" . web-mode))
  :custom
  (vue-html-tab-width 2)
  (indent-tabs-mode nil)
  :mode "\\.vue\\'"
  :config
  (add-to-list 'apheleia-mode-alist '(vue-mode . prettier))
  (after! prism
    (add-to-list 'prism-whitespace-mode-indents '(vue-mode . vue-html-tab-width))))
;; (use-package vue-ts-mode
;;   :mode "\\.vue\\'"
;;   :ensure (vue-ts-mode
;;            :type git
;;            :host github
;;            :repo "8uff3r/vue-ts-mode"
;;            :files ("*.el"))
;;   :init
;;   (add-to-list 'auto-mode-alist '("\\.vue\\'" . web-mode)))
#+end_src

#+RESULTS:
: [nil 26424 46805 415224 nil elpaca-process-queues nil nil 688000 nil]

*** JS-PKG-Mode 
:PROPERTIES:
:CUSTOM_ID: js-pkg-mode
:END:
#+begin_src emacs-lisp
(use-package js-pkg-mode
  :defer 2

  :ensure '(js-pkg-mode :type git :host github :repo "ovistoica/js-pkg-mode")
  ;; :custom
  ;; (js-pkg-mode-keymap-prefix "SPC c j")

  :init (js-pkg-global-mode 1))
#+end_src

#+RESULTS:
: [nil 26448 41937 468486 nil elpaca-process-queues nil nil 756000 nil]

*** Clojure
:PROPERTIES:
:CUSTOM_ID: clojure
:END:
#+begin_src emacs-lisp
(use-package cider
  :defer 5
  :config
  (setq org-babel-clojure-backend 'cider))
(use-package cider-eval-sexp-fu)
(use-package flycheck-clj-kondo)
(use-package clojure-mode
  :defer 2)
(use-package clojure-ts-mode
  :defer 2
  :after clojure-mode
  :preface
  (defun clojure-lsp-start()
    ;; (define-key go-ts-mode-map
    ;;             ["RET"] 'newline-and-indent)
    ;; (define-key go-ts-mode-map
    ;;             ["M-RET"] 'newline)
    ;; ;; (add-hook 'before-save-hook #'lsp-format-buffer t t)
    ;; ;; (add-hook 'before-save-hook #'lsp-organize-imports t t)

    ;; (add-hook 'before-save-hook 'gofmt-before-save)
    ;; (setq-local tab-width 4)
    (require 'flycheck-clj-kondo)
    (smartparens-mode)            
    (lsp-deferred)
    )
  :hook ((clojure-ts-mode clojure-mode clojurescript-mode) . clojure-lsp-start))
;; (use-package clj-refactor
;;   :init
;;   (defun start-clojure-refactor ()
;;     (clj-refactor-mode 1)
;;     (yas-minor-mode 1))
;;   :hook ((clojure-mode clojure-ts-mode) start-clojure-refactor))
#+end_src

#+RESULTS:
: [nil 26346 48426 591037 nil elpaca-process-queues nil nil 283000 nil]
*** Janet
:PROPERTIES:
:CUSTOM_ID: janet
:END:
#+begin_src emacs-lisp
(use-package janet-mode)
(use-package parsec)
(elpaca-wait)
;; (use-package ijanet-mode
;;   :after janet-mode parsec
;;   :ensure ( ijanet-mode
;;            :type git
;;            :host github
;;            :repo "SerialDev/ijanet-mode"
;;            ;; :branch "master"
;;            :main "ijanet.el"
;;            :files ("*.el")))
(use-package janet-ts-mode
  :ensure (:host github
           :repo "sogaiu/janet-ts-mode"
           :files ("*.el")))
#+end_src

#+RESULTS:
: [nil 26326 8402 77101 nil elpaca-process-queues nil nil 792000 nil]

**** AJRepl
:PROPERTIES:
:CUSTOM_ID: ajrepl
:END:
#+begin_src emacs-lisp
(use-package ajrepl
  :after janet-ts-mode
  :ensure (ajrepl :type git :host github  :repo "sogaiu/ajrepl" :files ("*.el" "ajrepl"))
  :hook (janet-ts-mode . ajrepl-interaction-mode))
#+end_src

#+RESULTS:
: [nil 26332 13745 318785 nil elpaca-process-queues nil nil 939000 nil]

**** Flycheck
:PROPERTIES:
:CUSTOM_ID: flycheck
:END:
#+begin_src emacs-lisp
(use-package flycheck-janet
  :ensure (flycheck-janet  :type git :host github  :repo "sogaiu/flycheck-janet" :files ("*.el"))
  :after (flycheck janet-ts-mode)
  )
#+end_src

#+RESULTS:
: [nil 26332 14054 302533 nil elpaca-process-queues nil nil 83000 nil]

** Hyprlang-ts-mode
:PROPERTIES:
:CUSTOM_ID: hyprlang-ts-mode
:END:
#+begin_src emacs-lisp
(use-package hyprlang-ts-mode
  :ensure (:type git :host github :repo "Nathan-Melaku/hyprlang-ts-mode")
  :hook
  (hyprlang-ts-mode . prism-mode)
  :custom
  (hyprlang-ts-mode-indent-offset 4))
#+end_src

#+RESULTS:
: [nil 26437 35138 78316 nil elpaca-process-queues nil nil 220000 nil]

**** Treesitter-auto
:PROPERTIES:
:CUSTOM_ID: treesitter-auto
:END:
#+begin_src emacs-lisp
(use-package treesit-auto
  :defer 2
  :config
  (global-treesit-auto-mode))
#+end_src

#+RESULTS:
: [nil 26345 25834 305414 nil elpaca-process-queues nil nil 231000 nil]

* Codemetrics
:PROPERTIES:
:CUSTOM_ID: codemetrics
:END:
#+begin_src emacs-lisp
;; (use-package codemetrics
;;   :ensure (codemetrics :type git :host github :repo "jcs-elpa/codemetrics")
;;   :after tree-sitter
;;   :hook
;;   ((python-mode js2-mode clojure-mode) . codemetrics-mode)
;;   :config
;;   (codemetrics-mode 1))
#+end_src

#+RESULTS:
: [nil 26363 58125 743879 nil elpaca-process-queues nil nil 918000 nil]

